public class Main2 {
    /*
    Р РµР°Р»РёР·СѓР№С‚Рµ РјРµС‚РѕРґ, РїСЂРёРЅРёРјР°СЋС‰РёР№ РІ РєР°С‡РµСЃС‚РІРµ Р°СЂРіСѓРјРµРЅС‚Р° С†РµР»РѕС‡РёСЃР»РµРЅРЅС‹Р№ РґРІСѓРјРµСЂРЅС‹Р№ РјР°СЃСЃРёРІ.
    РќРµРѕР±С…РѕРґРёРјРѕ РїРѕСЃС‡РёС‚Р°С‚СЊ Рё РІРµСЂРЅСѓС‚СЊ СЃСѓРјРјСѓ СЌР»РµРјРµРЅС‚РѕРІ СЌС‚РѕРіРѕ РјР°СЃСЃРёРІР°.
    РџСЂРё СЌС‚РѕРј РЅР°РєР»Р°РґС‹РІР°РµРј РЅР° РјРµС‚РѕРґ 2 РѕРіСЂР°РЅРёС‡РµРЅРёСЏ:
    РјРµС‚РѕРґ РјРѕР¶РµС‚ СЂР°Р±РѕС‚Р°С‚СЊ С‚РѕР»СЊРєРѕ СЃ РєРІР°РґСЂР°С‚РЅС‹РјРё РјР°СЃСЃРёРІР°РјРё (РєРѕР»-РІРѕ СЃС‚СЂРѕРє = РєРѕР»-РІСѓ СЃС‚РѕР»Р±С†РѕРІ),
    Рё РІ РєР°Р¶РґРѕР№ СЏС‡РµР№РєРµ РјРѕР¶РµС‚ Р»РµР¶Р°С‚СЊ С‚РѕР»СЊРєРѕ Р·РЅР°С‡РµРЅРёРµ 0 РёР»Рё 1.
    Р•СЃР»Рё РЅР°СЂСѓС€Р°РµС‚СЃСЏ РѕРґРЅРѕ РёР· СѓСЃР»РѕРІРёР№, РјРµС‚РѕРґ РґРѕР»Р¶РµРЅ Р±СЂРѕСЃРёС‚СЊ RuntimeException СЃ СЃРѕРѕР±С‰РµРЅРёРµРј РѕР± РѕС€РёР±РєРµ.
     */
    public static void main(String[] args) {
        int[][] array = new int[][]{{1, 0, 1}, {0, 0, 5}, {1, 1, 1}};
        try {
            int res = sum(array);
            System.out.println("Р”Р»РёРЅР° РјР°СЃСЃРёРІР° СЂР°РІРЅР°: " + res);
        } catch (RuntimeException exception){
            exception.printStackTrace();
            System.out.println(exception.getMessage());
        }
        System.out.println("РљРѕРЅРµС† СЂР°Р±РѕС‚С‹");
    }

    static int sum(int[][] arr) {
        int sum = 0;
        for (int i = 0; i < arr.length; i++) {
            if (arr.length != arr[i].length) {
                throw new RuntimeException("РњР°СЃСЃРёРІ РЅРµ РєРІР°РґСЂР°С‚РЅС‹Р№");
            }
            for (int j = 0; j < arr[i].length; j++) {
                if (arr[i][j] != 0 && arr[i][j] != 1) {
                    throw new RuntimeException("РР»РµРјРµРЅС‚ СЃ РёРЅРґРµРєСЃР°РјРё [" + i + ", " + j + "] " +
                            "РЅРµ РІР°РµРЅ 1 РёР»Рё 0");
                }
                sum += arr[i][j];
            }
        }
        return sum;
    }
}